---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeHasIntermediateSupport
source: html/173d4413-beba-7103-f83d-4fd31d610fbe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeHasIntermediateSupport Property

"Middle Support": Whether stairs is assembled

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeHasIntermediateSupport { get; }
```